modules/swanemacs-org.org
#+TITLE: SwanEmacs Org-mode settings
#+AUTHOR: Anthony Le Cigne

[[http://orgmode.org/][Org-mode]]!

* Table of contents                                            :toc:noexport:
- [[#org-mode][=org-mode=]]
  - [[#document-structure][Document structure]]
  - [[#minor-modes][Minor modes]]
  - [[#hyperlinks][Hyperlinks]]
  - [[#agenda-views][Agenda views]]
  - [[#items][items]]
  - [[#dates-and-times][Dates and times]]
  - [[#capture---refile---archive][Capture - refile - archive]]
  - [[#markup-for-rich-export][Markup for rich export]]
  - [[#exporting][Exporting]]
  - [[#org-publish][Org publish]]
  - [[#working-with-source-code][Working with source code]]
  - [[#miscellaneous][Miscellaneous]]
  - [[#custom-functions][Custom functions]]
- [[#org-inlinetask][=org-inlinetask=]]
- [[#org-bullets][=org-bullets=]]
- [[#org-crypt][=org-crypt=]]
- [[#org-pomodoro][=org-pomodoro=]]
- [[#org-sticky-header][=org-sticky-header=]]
- [[#org-ref][=org-ref=]]
- [[#toc-org][=toc-org=]]
- [[#org-tree-slide-and-demo-it][=org-tree-slide= and =demo-it=]]
- [[#wrapping-up][Wrapping up]]

* =org-mode=

Top-level =use-package= form in Noweb syntax:

#+BEGIN_SRC emacs-lisp :tangle yes :noweb no-export
  (use-package org
    :ensure nil ; correct version already installed by init.el
    :delight org-mode "org"
    :bind (("C-c l" . org-store-link)
           ("C-c a" . org-agenda)
           ("C-c b" . org-iswitchb)
           ("C-c f" . org-footnote-new)
           ("C-c c" . org-capture)
           ("<f7>" . org-agenda)
           :map org-mode-map
           ("C-c C-x D" . swanemacs-org-insert-drawer-note)
           ("C-c C" . swanemacs-org-insert-cookie-end-of-heading)
           ("C-c s" . helm-org-in-buffer-headings))
    :config
    <<config>>)
#+END_SRC

The following sections describe the =<<config>>= Noweb reference.

** Document structure

*** Structure editing

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-M-RET-may-split-line t)
#+END_SRC

*** Drawers

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (defun swanemacs-org-insert-drawer-note ()
    (interactive)
    (org-insert-drawer nil "NOTES"))
#+END_SRC

** Minor modes

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (delight '((org-src-mode " org-src" "org-src")
             (org-indent-mode nil "org")))

#+END_SRC

** Hyperlinks

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-link-frame-setup
        '((vm . vm-visit-folder-other-frame)
          (vm-imap . vm-visit-imap-folder-other-frame)
          (gnus . org-gnus-no-new-news)
          (file . find-file)
          (wl . wl-other-frame)))

  (setq org-link-file-path-type 'relative)
#+END_SRC

From [[https://emacs.stackexchange.com/a/10714][here]].

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (defun swanemacs-org-replace-link-by-link-description ()
    "Replace an org link by its description or if empty its address"
    (interactive)
    (if (org-in-regexp org-bracket-link-regexp 1)
        (let ((remove (list (match-beginning 0) (match-end 0)))
              (description (if (match-end 3) 
                               (org-match-string-no-properties 3)
                             (org-match-string-no-properties 1))))
          (apply 'delete-region remove)
          (insert description))))
#+END_SRC

** Agenda views

*** Agenda files

 #+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
   (setq org-agenda-files
         (delq nil
               (mapcar (lambda (x) (when (file-exists-p x) x))
                       (list swanemacs-org-todo-file swanemacs-org-entourage-file))))
 #+END_SRC

*** Built-in

 #+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
   (setq org-agenda-include-diary nil
         org-agenda-todo-ignore-with-date nil
         org-agenda-skip-scheduled-if-done nil
         org-agenda-skip-deadline-if-done nil
         org-agenda-sorting-strategy '((agenda habit-down time-up category-keep priority-down)
                                       (todo priority-down category-keep)
                                       (tags priority-down category-keep)
                                       (search category-keep))
         org-agenda-start-with-follow-mode nil
         org-agenda-format-date "\n%Y-%m-%d %a\n")

   (defun swanemacs-org-place-agenda-tags ()
     "Put the agenda tags by the right border of the agenda window."
     (setq org-agenda-tags-column (- 4 (window-width)))
     (org-agenda-align-tags))

   (add-hook 'org-finalize-agenda-hook 'swanemacs-org-place-agenda-tags)
 #+END_SRC

