modules/elisp/swanemacs-org.el
(use-package org
  :ensure org-plus-contrib
  :delight org-mode "org"
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c b" . org-iswitchb)
         ("C-c f" . org-footnote-new)
         ("C-c c" . org-capture)
         ("<f7>" . org-agenda)
         :map org-mode-map
         ("C-c C-x D" . swanemacs-org-insert-drawer-note)
         ("C-c C" . swanemacs-org-insert-cookie-end-of-heading)
         ("C-c s" . helm-org-in-buffer-headings))
  :config
  (setq org-M-RET-may-split-line t)
  (defun swanemacs-org-insert-drawer-note ()
    (interactive)
    (org-insert-drawer nil "NOTES"))
  (delight '((org-src-mode " org-src" "org-src")
             (org-indent-mode nil "org")))
  
  (setq org-link-frame-setup
        '((vm . vm-visit-folder-other-frame)
          (vm-imap . vm-visit-imap-folder-other-frame)
          (gnus . org-gnus-no-new-news)
          (file . find-file)
          (wl . wl-other-frame)))
  
  (setq org-link-file-path-type 'relative)
  (defun swanemacs-org-replace-link-by-link-description ()
    "Replace an org link by its description or if empty its address"
    (interactive)
    (if (org-in-regexp org-bracket-link-regexp 1)
        (let ((remove (list (match-beginning 0) (match-end 0)))
              (description (if (match-end 3) 
                               (org-match-string-no-properties 3)
                             (org-match-string-no-properties 1))))
          (apply 'delete-region remove)
          (insert description))))
  (setq org-agenda-files
        (delq nil
              (mapcar (lambda (x) (when (file-exists-p x) x))
                      (list swanemacs-org-todo-file swanemacs-org-entourage-file))))
  (setq org-agenda-include-diary nil
        org-agenda-todo-ignore-with-date nil
        org-agenda-skip-scheduled-if-done nil
        org-agenda-skip-deadline-if-done nil
        org-agenda-sorting-strategy '((agenda habit-down time-up category-keep priority-down)
                                      (todo priority-down category-keep)
                                      (tags priority-down category-keep)
                                      (search category-keep))
        org-agenda-start-with-follow-mode nil
        org-agenda-format-date "\n%Y-%m-%d %a\n")
  
  (defun swanemacs-org-place-agenda-tags ()
    "Put the agenda tags by the right border of the agenda window."
    (setq org-agenda-tags-column (- 4 (window-width)))
    (org-agenda-align-tags))
  
  (add-hook 'org-finalize-agenda-hook 'swanemacs-org-place-agenda-tags)
