modules/swanemacs-org.org
*** Custom agenda views

cf. https://github.com/fniessen/emacs-leuven

 #+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
   (setq swanemacs--org-cleaning-tag "cleaning")

   (defun swanemacs-org-add-option (view option)
     (list (car view)
           (cadr view)
           (cons option (nth 2 view))))

   (setq org-agenda-custom-commands nil)

   (defconst swanemacs-org-completed-date-regexp
     (concat "\\("
             "CLOSED: \\[%Y-%m-%d"
             "\\|"
             "- State \"\\(DONE\\|CANCELED\\)\" * from .* \\[%Y-%m-%d"
             "\\|"
             "- State .* ->  *\"\\(DONE\\|CANCELED\\)\" * \\[%Y-%m-%d"
             "\\) ")
     "Matches any completion time stamp.")

   ;; Simple views

   ;; Events today
   (setq swanemacs-org-acc-events-today
         '(agenda ""
                  ((org-agenda-overriding-header "Events today")
                   (org-agenda-entry-types '(:timestamp :sexp))
                   (org-agenda-span 'day))))

   ;; Events this week
   (setq swanemacs-org-acc-events-week
         '(agenda ""
                  ((org-agenda-overriding-header "Events this week")
                   (org-agenda-entry-types '(:timestamp :sexp))
                   (org-agenda-span 'week))))

   ;; Events this month
   (setq swanemacs-org-acc-events-month
         '(agenda ""
                  ((org-agenda-overriding-header "Events this month")
                   (org-agenda-entry-types '(:timestamp :sexp))
                   (org-agenda-span 'month))))

   ;; Deadlines
   (setq swanemacs-org-acc-deadlines
         '(agenda ""
                  ((org-agenda-overriding-header "Deadlines")
                   (org-agenda-span 'day)
                   (org-agenda-entry-types '(:deadline))
                   (org-deadline-warning-days 365)
                   (org-agenda-time-grid nil)
                   (org-agenda-sorting-strategy '(deadline-up)))))

   ;; Scheduled today
   (setq swanemacs-org-acc-scheduled-today
         '(agenda ""
                  ((org-agenda-overriding-header "Scheduled today")
                   (org-agenda-entry-types '(:scheduled))
                   (org-agenda-span 'day)
                   (org-agenda-sorting-strategy
                    '(priority-down time-down))
                   (org-agenda-start-on-weekday nil)
                   (org-agenda-time-grid nil))))

   ;; Scheduled this month
   (setq swanemacs-org-acc-scheduled-fortnight
         '(agenda ""
                  ((org-agenda-overriding-header "Scheduled these next 2 weeks")
                   (org-agenda-entry-types '(:scheduled))
                   (org-agenda-span 14)
                   (org-agenda-skip-function
                    (lambda ()
                      (let ((subtree-end (save-excursion (org-end-of-subtree t))))
                        (if (member swanemacs--org-cleaning-tag (org-get-tags-at))
                            subtree-end
                          nil))))
                   (org-agenda-sorting-strategy
                    '(priority-down time-down))
                   (org-agenda-start-on-weekday nil)
                   (org-agenda-time-grid nil))))

   ;; Waiting
   (setq swanemacs-org-acc-waiting
         '(todo "WAITING"
                ((org-agenda-overriding-header "Waiting for something\n"))))

   ;; Cleaning tasks today
   (setq swanemacs-org-acc-cleaning-today
         '(agenda ""
                  ((org-agenda-overriding-header "Cleaning today")
                   (org-agenda-entry-types '(:scheduled))
                   (org-agenda-span 'day)
                   (org-agenda-skip-function
                    'swanemacs-org-acc-cleaning-today-filter)
                   (org-agenda-sorting-strategy
                    '(priority-down time-down))
                   (org-agenda-start-on-weekday nil)
                   (org-agenda-time-grid nil)
                   (org-agenda-format-date ""))))

   (defun swanemacs-org-acc-cleaning-today-filter ()
     (let ((subtree-end (save-excursion (org-end-of-subtree t))))
       (if (member swanemacs--org-cleaning-tag (org-get-tags-at))
           nil		; do no skip
         subtree-end)))	; skip

   ;; High priority
   (setq swanemacs-org-acc-high-priority
         '(tags-todo "PRIORITY={A}"
                     ((org-agenda-overriding-header "Important\n"))))

   ;; Medium priority
   (setq swanemacs-org-acc-medium-priority
         '(tags-todo "PRIORITY={B}"
                     ((org-agenda-overriding-header "Somewhat important\n")
                      (org-agenda-skip-function
                       '(org-agenda-skip-entry-if 'notregexp "\\=.*\\[#B\\]"
                                                  'timestamp)))))

   ;; Low priority
   (setq swanemacs-org-acc-low-priority
         '(tags-todo "PRIORITY={C}"
                     ((org-agenda-overriding-header "Not important\n"))))

   ;; No priority
   (setq swanemacs-org-acc-no-priority
         '(todo ""
                ((org-agenda-overriding-header "No priority\n")
                 (org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'regexp "\\=.*\\[#[A-D]\\]"
                                             'todo '("TOCOMPLETE" "COMPLETING"))))))

   ;; Tasks in the inbox
   (setq swanemacs-org-acc-inbox
         '(tags-todo "inbox"
                     ((org-agenda-overriding-header "Tasks in the inbox\n"))))

   ;; Block views

   ;; Daily digest
   (setq swanemacs-org-acc-block-today
         `((,swanemacs-org-acc-events-today
            ,(swanemacs-org-add-option
              swanemacs-org-acc-scheduled-today
              '(org-agenda-skip-function 'swanemacs-org-acc-scheduled-today-filter))
            ,swanemacs-org-acc-inbox
            ,swanemacs-org-acc-deadlines
            ,swanemacs-org-acc-waiting)
           ((org-agenda-format-date ""))))

   (defun swanemacs-org-acc-scheduled-today-filter ()
     (let ((subtree-end (save-excursion (org-end-of-subtree t))))
       (if (or (member swanemacs--org-cleaning-tag (org-get-tags-at))
               (member (org-get-todo-state) '("WAITING" "HOLD" "DONE" "CANCELED")))
           subtree-end	; skip
         nil)))		; don't skip

   ;; No timestamp (by priority)
   (setq swanemacs-org-acc-block-priority
         `((,swanemacs-org-acc-high-priority
            ,swanemacs-org-acc-medium-priority
            ,swanemacs-org-acc-low-priority
            ,swanemacs-org-acc-no-priority)
           ((org-agenda-skip-function
             '(org-agenda-skip-entry-if 'timestamp)))))

   ;; Wrapping up
   (setq org-agenda-custom-commands
         `(;; Daily digest
           ("d" "To[d]ay" ,@swanemacs-org-acc-block-today)
           ;; No timestamp
           ("n" "[N]o timestamp" ,@swanemacs-org-acc-block-priority)
           ;; Events
           ("v" . "E[v]ents...")
           ("vt" "Events [t]oday" ,@swanemacs-org-acc-events-today)     
           ("vw" "Events this [w]eek" ,@swanemacs-org-acc-events-week)
           ("vm" "Events this [m]onth" ,@swanemacs-org-acc-events-month)
           ;; Scheduled tasks
           ("h" . "Sc[h]eduled tasks...")
           ("hd" "Scheduled to[d]ay" ,@swanemacs-org-acc-scheduled-today)
           ("hf" "Scheduled for the next fortnight" ,@swanemacs-org-acc-scheduled-fortnight)
           ;; Cleaning
           ("c" "[C]leaning" ,@swanemacs-org-acc-cleaning-today)))
 #+END_SRC

** Todo items

*** Basic todo functionality

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-treat-S-cursor-todo-selection-as-state-change nil
        org-treat-insert-todo-heading-as-state-change t
        org-src-fontify-natively t
        org-confirm-babel-evaluate nil
        org-src-tab-acts-natively t
        org-special-ctrl-a/e t
        org-special-ctrl-k t
        org-agenda-skip-deadline-if-done nil
        org-agenda-skip-scheduled-if-done nil
        org-agenda-start-on-weekday 1
        org-use-fast-todo-selection t)
#+END_SRC

*** Extended use of todo keywords

