modules/swanemacs-org.org
**** Todo keywords
:PROPERTIES:
:CUSTOM_ID: todokw
:END:

Keywords for tasks:

- =TODO=: the task has yet to be started.
- =DOING=: the task has been started, but it's still not DONE.
- =WAITING=: the task has been started, but it is waiting for something.
- =HOLD=: the task is on hold.
- =TODO?=: I don't know if I will have to even start the task.
- =DONE=: the task is done.
- =CANCELED=: the task was not done but don't require action anymore.

Keywords for projects:

- =TOCOMPLETE=: like =TODO=, for a project.
- =COMPLETING=: like =DOING=, for a project.
- =TOCOMPLETE?=: like =TODO?=, for a project.
- =COMPLETED=: like =DONE=, for a project.
- =ABORTED=: like =CANCELED=, for a project.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-todo-keywords
        '((sequence "TODO(t!)"
                    "DOING(D!)"
                    "WAITING(w@/!)"
                    "HOLD(h@/!)"
                    "TODO?(m!)"
                    "|"
                    "DONE(d!)"
                    "CANCELED(x@)")
          (sequence "TOCOMPLETE(T!)"
                    "COMPLETING(C!)"
                    "TOCOMPLETE?(M!)"
                    "|"
                    "COMPLETED(c!)"
                    "ABORTED(X@)")))
#+END_SRC

Faces:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (defface swanemacs-org-todo-kwd
    '((t (:weight bold :foreground "red")))
    "Face used to display tasks yet to be worked on.")

  (defface swanemacs-org-in-progress-kwd
    '((t (:weight bold :foreground "orange")))
    "Face used to display tasks in progress.")

  (defface swanemacs-org-someday-kwd
    '((t (:weight bold :foreground "dark red")))
    "Face used to display tasks that might be done someday.")

  (defface swanemacs-org-done-kwd
    '((t (:weight bold :foreground "forest green")))
    "Face used to display org state DONE.")

  (setq org-todo-keyword-faces
        '(("TODO" . swanemacs-org-todo-kwd)
          ("TOCOMPLETE" . swanemacs-org-todo-kwd)
          ("TODO?" . swanemacs-org-someday-kwd)
          ("TOCOMPLETE?" . swanemacs-org-someday-kwd)
          ("DOING" . swanemacs-org-in-progress-kwd)
          ("COMPLETING" . swanemacs-org-in-progress-kwd)
          ("WAITING" . swanemacs-org-in-progress-kwd)
          ("HOLD" . swanemacs-org-in-progress-kwd)
          ("DONE" . swanemacs-org-done-kwd)
          ("COMPLETED" . swanemacs-org-done-kwd)
          ("CANCELED" . swanemacs-org-done-kwd)
          ("ABORTED" . swanemacs-org-done-kwd)))
#+END_SRC

***** Breaking tasks down into subtasks

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-provide-todo-statistics '("TODO" "DOING" "WAITING" "TODO?"))
  (setq org-hierarchical-todo-statistics nil)
#+END_SRC

**** Todo dependencies

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-enforce-todo-dependencies t
        org-enforce-todo-checkbox-dependencies nil
        org-agenda-dim-blocked-tasks t)
#+END_SRC

*** Progress logging

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-log-into-drawer t)
#+END_SRC

*** Priorities

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-lowest-priority ?C)
#+END_SRC

** Dates and times

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-deadline-warning-days 14)
#+END_SRC

** Capture - refile - archive

*** Capture templates

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-capture-templates
        '(;; Tâches
          ("t" "Nouvelle tâche"
           entry
           (file+olp swanemacs-org-todo-file "Todo" "Inbox")
           "* TODO %?"
           :prepend t :kill-buffer t)
          ))
#+END_SRC

*** Archive

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-archive-location "%s_archive::")

  (defadvice org-archive-subtree
      (before add-inherited-tags-before-org-archive-subtree activate)
    "add inherited tags before org-archive-subtree"
    (org-set-tags-to (org-get-tags-at)))
#+END_SRC

** Markup for rich export

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-hide-emphasis-markers nil)
#+END_SRC

** Exporting

*** Exporting

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-ascii-links-to-notes nil)
#+END_SRC

*** iCalendar export

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-icalendar-use-deadline nil
        org-icalendar-use-scheduled nil
        org-icalendar-include-body nil)
#+END_SRC

** Org publish

 #+BEGIN_SRC emacs-lisp :tangle no
   (setq org-publish-project-alist
         `(("org-notes"
            :base-directory ,swanemacs-website-base-dir
            :base-extension "org"
            :publishing-directory ,swanemacs-website-pub-dir
            :recursive t
            :publishing-function org-html-publish-to-html
            :headline-levels 4             ; Just the default for this project.
            :auto-preamble t
            :html-preamble swanemacs-org-mode-blog-preamble)
           ("org-static"
            :base-directory ,swanemacs-website-base-dir
            :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
            :publishing-directory ,swanemacs-website-pub-dir
            :recursive t
            :publishing-function org-publish-attachment)
           ("org" :components ("org-notes" "org-static"))
           ("emacs-config"
            :base-directory ,user-emacs-directory
            :base-extension "org"
            :publishing-directory ,swanemacs-emacs-config-pub-dir
            :recursive t
            :publishing-function org-html-publish-to-html
            :exclude "elpa"
            ;; :headline-levels 4
            :auto-preamble t)))

   (defun swanemacs-org-mode-blog-preamble (options)
     "The function that creates the preamble top section for the blog.
   OPTIONS contains the property list from the org-mode export."
     (let ((base-directory (plist-get options :base-directory)))
       (org-babel-with-temp-filebuffer (expand-file-name "top-bar.html" base-directory) (buffer-string))))
 #+END_SRC

** Working with source code

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  ;; (with-eval-after-load 'org
  ;;   (set-face-attribute 'org-meta-line nil :height 0.7 :slant 'normal))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((dot . t)
     (lisp . t)
     (python . t)
     (R . t)
     (ruby . t)
     (shell . t)))
#+END_SRC

** Miscellaneous

*** Speed keys

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-use-speed-commands t
        org-speed-commands-user '(("a" org-archive-subtree)))
#+END_SRC

*** A cleaner outline view

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (setq org-startup-indented t)
  (delight 'org-indent-mode nil "org-indent")
#+END_SRC

** Custom functions

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref config
  (defun swanemacs-org-insert-cookie-end-of-heading ()
    "Insert a cookie at the end of the current heading and update
      it, unless it is already here. In that case, delete it."
    (interactive)
    (save-excursion
      (unless (org-at-heading-p)
        (org-back-to-heading))
      (beginning-of-line)
      (if (not (looking-at ".* \\[[0-9]*/[0-9]*\\]"))
          (progn
            (org-end-of-line)
            (insert " [/]")
            (org-update-statistics-cookies nil)
            (swanemacs-org-change-tags-column))
        (progn
          (replace-regexp "\\(.*\\) \\[[0-9]*/[0-9]*\\]\\(.*\\)" "\\1\\2" nil (point) (save-excursion (end-of-line) (point)))
          (swanemacs-org-change-tags-column)))))

  (defun swanemacs-org-schedule-if-doing-or-waiting ()
    "Schedule when the task is marked DOING or WAITING, unless the
  item is already scheduled."
    (when (and (or (string= org-state "DOING")
                   (string= org-state "WAITING"))
               (not (string= org-last-state org-state))
               (not (org-get-scheduled-time (point))))
      (org-schedule nil "")))

  (add-hook 'org-after-todo-state-change-hook
            'swanemacs-org-schedule-if-doing-or-waiting)

  ;; https://emacs.stackexchange.com/a/9588
  (require 'cl-lib)
  (require 'dash)

  (defun swanemacs-todo-to-int (todo)
    (cl-first (-non-nil
            (mapcar (lambda (keywords)
                      (let ((todo-seq
                             (-map (lambda (x) (cl-first (split-string  x "(")))
                                   (cl-rest keywords)))) 
                        (cl-position-if (lambda (x) (string= x todo)) todo-seq)))
                    org-todo-keywords))))

  (defun swanemacs-org-sort-key ()
    (let* ((todo-max (apply #'max (mapcar #'length org-todo-keywords)))
           (todo (org-entry-get (point) "TODO"))
           (todo-int (if todo (swanemacs-todo-to-int todo) todo-max))
           (priority (org-entry-get (point) "PRIORITY"))
           (priority-int (if priority (string-to-char priority) org-default-priority)))
      (format "%03d %03d" todo-int priority-int)
      ))

  (defun swanemacs-org-sort-entries ()
    (interactive)
    (org-sort-entries nil ?f #'swanemacs-org-sort-key))
#+END_SRC

* =org-inlinetask=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-inlinetask
    :commands org-inlinetask-insert-task
    :bind (:map org-mode-map
                ("C-c C-x t" . org-inlinetask-insert-task))
    :after org)
#+END_SRC

* =org-bullets=

=org-bullets= doesn't work well for me under Windows.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-bullets
    :ensure t
    :after org
    :init
    (when (eq system-type 'gnu/linux)
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))))
#+END_SRC

* =org-crypt=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-crypt
    :ensure nil ; in contrib
    :bind (("C-c z" . org-decrypt-entry))
    :config
    (org-crypt-use-before-save-magic)
    (setq org-tags-exclude-from-inheritance (quote ("crypt"))
          (setq org-crypt-key "F62FE7A4")))
#+END_SRC

