modules/swanemacs-org.org
* TODO =org-pomodoro=
:LOGBOOK:
- State "TODO"       from              [2019-03-23 sam. 15:48]
:END:

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package org-pomodoro
    :ensure t
    :after org
    :config
    (add-hook 'org-pomodoro-finished-hook
              (lambda ()
                (swanemacs-growl :title "Pomodoro terminé !"
                           :message "Une pause s'impose.")))

    (add-hook 'org-pomodoro-long-break-finished-hook
              (lambda ()
                (swanemacs-growl :title "Longue pause terminée !"
                           :message "Au travail !")))

    (add-hook 'org-pomodoro-short-break-finished-hook
              (lambda ()
                (swanemacs-growl :title "Break terminé !"
                           :message "Continuons !"))))
#+END_SRC

* =org-sticky-header=

Use =org-sticky-header-mode= to use that.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-sticky-header
    :ensure t
    :config
    (setq org-sticky-header-full-path 'full))
#+END_SRC

* =org-ref=

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (require 'org-id)
  ;; (require 'org-ref-wos)
  ;; (require 'org-ref-scopus)
  ;; (require 'org-ref-pubmed)
#+END_SRC

* =toc-org=

[[https://github.com/snosov1/toc-org][toc-org]] is an Emacs utility to have an up-to-date table of contents in
the org files without exporting (useful primarily for readme files on
GitHub)

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package toc-org
    :ensure t
    :hook (org-mode . toc-org-enable))
#+END_SRC

* =org-tree-slide= and =demo-it=

[[https://github.com/takaxp/org-tree-slide][=org-tree-slide=]]'s GitHub page.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-tree-slide
    :ensure t
    :bind (:map org-tree-slide-mode-map
                ("<f9>" . org-tree-slide-move-previous-tree)
                ("<f10>" . org-tree-slide-move-next-tree)))
#+END_SRC

[[https://github.com/howardabrams/demo-it][=demo-it=]]'s GitHub page.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package demo-it
    :ensure t)
#+END_SRC

* Wrapping up

#+BEGIN_SRC emacs-lisp :tangle yes
  (provide 'swanemacs-org)
#+END_SRC
