modules/elisp/swanemacs-org.el

(use-package org-sticky-header
  :config
  (setq org-sticky-header-full-path 'full))

(use-package toc-org
  :hook (org-mode . toc-org-enable))

(use-package org-tree-slide
  :bind (:map org-tree-slide-mode-map
              ("<f9>" . org-tree-slide-move-previous-tree)
              ("<f10>" . org-tree-slide-move-next-tree)))

(use-package demo-it)

(provide 'swanemacs-org)
